Repository: StephenApolinario/stephenapolinario_flutter
Catalog: lib/l10n/intl_*.arb
Languages: pt

source: Home
pt: Início

source: About
pt: Sobre

source: Projects
pt: Projetos

source: Contact
pt: Contato

source: Language
pt: Idioma

source: English
pt: Inglês

source: Portuguese
pt: Português

# about_me_title
source: About Me
pt: Sobre mim

# bio_link
source: Keep reading my bio
pt: Continue lendo minha bio

# about_me
source: I've always been fascinated by the inner workings of computers, televisions, MP3 players, and other technologies. As a child, I would take my toys apart to try to understand how each component contributed to their function. Over time, this curiosity grew into a passion for programming, and finally led me to pursue a degree in Computer Engineering, where I was able to deepen my technical and theoretical knowledge.
pt: Eu sempre fui fascinado pelo funcionamento interno de computadores, televisores, MP3 players e outras tecnologias. Quando criança, eu desmontava meus brinquedos para tentar entender como cada componente contribuía para sua função. Com o passar do tempo, essa curiosidade se transformou em uma paixão por programação e, finalmente, me levou a me formar em Engenharia da Computação, onde pude aprofundar meus conhecimentos técnicos e teóricos.

# studying_skill
source: *Studying
pt: *Estudando

source: Coming Soon
pt: Em breve

source: View Project
pt: Ver projeto

source: Get In Touch
pt: Entre em contato

# sending_hello
source: Sending a quick hello to ask if i'd be interested in connecting, discussing potential collaborations or opportunities?
pt: Enviando um rápido olá para perguntar se eu estaria interessado em me conectar, discutir possíveis colaborações ou oportunidades?

# fill_info
source: Fill out the form below! I look forward to hearing from you!
pt: Preencha o formulário abaixo! Estou ansioso pelo seu contato!

# input_name
source: Name
pt: Nome

# input_message
source: Message
pt: Mensagem

# feeling_social
source: Feeling social? Find me on these online spaces too!
pt: Quer socializar? Me encontre também nessas redes sociais!

# fill_name
source: Please, fill your name with at least
pt: Por favor, preencha seu nome com pelo menos

# fill_email
source: Please, fill with a valid email
pt: Por favor, preencha com um e-mail válido.

# fill_text
source: Please, fill the text with at least
pt: Por favor, preencha sua mensagem com pelo menos

# chacarecters
source: characters.
pt: caracteres.

source: Send
pt: Enviar

source: Thank You
pt: Obrigado

# message_sent
source: Success! Your message has been sent!
pt: Sucesso! Sua mensagem foi enviada!

# excited_text
source: I'm excited to reading what you've shared ;)
pt: Estou animado para ler o que você compartilhou ;)

source: Looking for my
pt: Procurando pelo meu

source: My quick story
pt: Minha breve história

# since_my_early_years
source: Since I was 14 years old, building programming things has been my passion.
pt: Desde os 14 anos de idade, construir coisas com programação tem sido minha paixão.

# it_all_started
source: It all started with games, where I learned to program through the automation of lua bot scripts. So I started helping friends and selling scripts for some community of some games. And after that I started learning HTML and CSS.
pt: Tudo começou com jogos, onde conheci a programação por meio da automação de scripts de bots em Lua. Então, comecei a ajudar amigos e a vender scripts para algumas comunidades de alguns jogos. Depois, comecei a aprender HTML e CSS.

# that_same_drive
source: This passion for creating and learning is still part of who I am.
pt: Essa paixão por criar e aprender ainda faz parte de quem eu sou.

# in_my_previous_role
source: In my previous role as a junior developer, I used PHP, Laravel, SQL, CSS, HTML and Python. I had the opportunity to work with experienced developers and designers, gaining essential knowledge about what really makes a product stand out.
pt: Em minha função anterior como desenvolvedor júnior, usei PHP, Laravel, SQL, CSS, HTML e Python. Tive a oportunidade de colaborar com desenvolvedores e designers experientes, adquirindo conhecimentos essenciais sobre o que realmente faz um produto se destacar.

source: As a developer
pt: Como desenvolvedor

# during_project
source: During project development, I first dedicate myself to building the desired functionalities, and then, even somewhat perfectionist, I strive to make the code as organized as possible, commenting and ensuring that it is easy to understand for any collaborator.
pt: Durante o desenvolvimento do projeto, primeiro me dedico a construir as funcionalidades desejadas e, até um pouco perfeccionista, me esforço para deixar o código o mais organizado possível, comentando e garantindo que seja de fácil compreensão para qualquer colaborador.

# i_prioritize_efficiency
source: I prioritize efficiency and ease of maintenance in everything I do.
pt: Priorizo a eficiência e a facilidade de manutenção em tudo o que faço.

# while_function_features
source: While functional features are important, I believe that the real value lies in sustainable and adaptable code. It's not enough just to make something work; it's crucial to build it to stand the test of time and be easily maintained.
pt: Embora os recursos funcionais sejam importantes, acredito que o valor real está no código sustentável e adaptável. Não basta apenas fazer algo funcionar; é fundamental construí-lo para resistir ao tempo e ser facilmente mantido.

# exploring_new_projects
source: Exploring new projects is a hobby for me; each one represents a new episode of learning and development.
pt: Explorar novos projetos é um hobby para mim; cada um deles representa um novo episódio de aprendizado e desenvolvimento.

# i_see_each_challenge
source: I see every challenge as an opportunity to expand my horizons and grow.
pt: Vejo cada desafio como uma oportunidade de expandir meus horizontes e crescer.

source: As a person
pt: Como pessoa

# my_journey
source: My journey is guided by an unceasing curiosity.
pt: Minha jornada é guiada por uma curiosidade incessante.

# the_world_fascinates
source: The world fascinates me with its mysteries and endless possibilities. This inner flame drives me to explore, question, and uncover the secrets that surround us. In 2022, I participated in an exchange program in Breckenridge, Colorado, USA, to improve my English and social skills while embracing new adventures and discovering my passion for snowboarding.
pt: O mundo me fascina com seus mistérios e possibilidades infinitas. Essa chama interior me leva a explorar, questionar e descobrir os segredos que nos cercam. Em 2022, participei de um programa de intercâmbio em Breckenridge, Colorado, para aprimorar meu inglês e minhas habilidades sociais, ao mesmo tempo em que abraçava novas aventuras e descobria minha paixão pelo snowboard.

# i_believe
source: I believe that knowledge is an endless ocean, and each new discovery brings me closer to the shore, but never makes me a complete expert.
pt: Acredito que o conhecimento é um oceano sem fim, e cada nova descoberta me aproxima da costa, mas nunca me torna um especialista completo.

# i_approach_each
source: I approach each day as a constantly evolving learner.
pt: Encaro cada dia como um aprendiz em constante evolução.

# this_learning_mindset
source: This learning mindset allows me to be humble, adaptable, and open to new ideas and perspectives.
pt: Essa mentalidade de aprendizado me permite ser humilde, adaptável e receptivo a novas ideias e perspectivas.

# the_combination
source: The combination of my
pt: A combinação de minhas

# curisioty
source: curiosity and passion for learning enriches my life and drives my professional development.
pt: curiosidade e paixão pelo aprendizado enriquecem minha vida e impulsionam meu desenvolvimento profissional.

# being_curious
source: Being curious and an eternal learner is not just a way of life, but a philosophy that allows me to continually grow both personally and professionally by remaining open to learning from others.
pt: Ser curioso e um eterno aprendiz não é apenas um modo de vida, mas uma filosofia que me permite crescer continuamente, tanto pessoal quanto profissionalmente, permanecendo aberto a aprender com os outros.

# i_am_excited
source: I'm excited to exchange ideas and collaborate!
pt: Estou animado para trocar ideias e colaborar!

source: Type
pt: Tipo

source: Code
pt: Código

source: My Role
pt: Minha função

source: Team
pt: Time

# project_porpouse_and_goal
source: Project purpose and goal
pt: Objetivo e meta do projeto

source: Spotlight
pt: Destaque

source: Lessons
pt: Lições

# museo_title
source: Museo: Accessibility App
pt: Museo: Aplicativo de Acessibilidade

# museo_type
source: Mobile application
pt: Aplicativo móvel

# museo_presentation_summary
source: Digital audioguide application for cell phones integrated with a bluetooth system, capable of guiding any visitor in a museum.
pt: Aplicativo de audioguia digital para telefones celulares integrado a um sistema bluetooth, capaz de orientar qualquer visitante em um museu.

# museo_summary
source: Digital Audio Guide application for mobile devices integrated with Bluetooth beacons located in museums. It guides visitors through tours while providing detailed speech synthesized descriptions of the exhibits. Key features include the ability to comment on artworks, allowing users to add artworks to favorites, control the guide's audio, earn badges based on quiz scores and analyze their performance. The system consists of three applications: one for users with core functionalities, another for museum administrators for configuration, and a Restful NodeJS API that bridges these systems and can be extended for future integration with others systems.
pt: Aplicativo de audioguia digital para dispositivos móveis que se integra aos dispositivos Bluetooth Beacon em museus. Ele orienta os visitantes durante os passeios e fornece descrições detalhadas das exposições por meio de sintetizador de voz. Os principais recursos incluem a capacidade de comentar sobre obras de arte, permitindo que os usuários adicionem suas obras preferidas aos favoritos, controlem o áudio do guia, ganhem emblemas com base em pontuações de questionários e analisem seu desempenho. O sistema consiste em três aplicativos: um para usuários com as funcionalidades essenciais, outro para administradores de museus para configuração e uma API Restful NodeJS que faz a ponte entre esses sistemas e que pode ser estendida para integração futura de outros sistemas.

# museo_role
source: As the only programmer, I had the opportunity to work on all stages of development, including the creation of the user application, the administrator application and the API.
pt: Por ser o único programador, tive a oportunidade de trabalhar em todas as etapas do desenvolvimento, o que incluiu a criação do aplicativo do usuário, do aplicativo do administrador e da API.

# museo_team
source: I worked together with a designer who created the prototype of the application, allowing me to concentrate exclusively on programming, without having to worry about front-end design.
pt: Trabalhei em conjunto com uma designer que criou o protótipo do aplicativo, permitindo me concentrar exclusivamente na programação, sem a necessidade de me preocupar com o design de front-end.

# museo_project_purpose
source: This project was my final submission for my computer engineering degree. I proposed a digital guide application and a wireless communication system aimed at enhancing museum interactions for visually impaired visitors while providing a user-friendly experience for the general public. The app functions as a guide that activates when visitors approach points of interest, narrating stored information based on selected tours. Additionally, an administrative app enables museum staff to register points of interest for activation and manage quizzes, tours, other administrators, and emblems. The client for this project is the Oceanographic Museum Univali (MOVI), the largest oceanographic museum in the Americas and the third largest globally in its field, housing one of Brazil's top four historical collections.
pt: Esse projeto foi minha apresentação final para o curso de engenharia da computação. Propus um aplicativo de guia digital e um sistema de comunicação sem fio com o objetivo de aprimorar as interações em museus para visitantes com deficiência visual e, ao mesmo tempo, proporcionar uma experiência de fácil utilização para o público em geral. O aplicativo funciona como um guia que é ativado quando os visitantes se aproximam de pontos de interesse, narrando informações armazenadas com base em passeios selecionados. Além disso, um aplicativo administrativo permite que a equipe do museu registre os pontos de interesse para ativação e gerencie questionários, passeios, outros administradores e emblemas. O cliente desse projeto é o Museu Oceanográfico Univali (MOVI), o maior museu oceanográfico das Américas e o terceiro maior do mundo em seu campo, abrigando uma das quatro maiores coleções históricas do Brasil.

# museo_spotlight
source: The standout feature of this project was undoubtedly its Bluetooth integration. This capability brought it to life, enabling an integration with real museums. This was made possible through beacon devices and the Flutter package flutter_blue_plus, allowing the application to detect nearby Bluetooth devices and initiate specific actions, like describing artwork, starting quizzes, presentations, and more. Another great functionality is the quizzes, which are highly beneficial for helping visitors retain the acquired knowledge. It also incorporates gamification by allowing users to earn emblems based on their score.
pt: O recurso de destaque desse projeto foi, sem dúvida, sua integração Bluetooth. Esse recurso deu vida ao aplicativo, permitindo uma integração com museus reais. Isso foi possível por meio de dispositivos beacon e do pacote flutter flutter_blue_plus do Flutter, permitindo que o aplicativo detectasse dispositivos Bluetooth próximos e iniciasse ações específicas, como descrever obras de arte, iniciar questionários, apresentações e muito mais. Outra funcionalidade imporante são os quizzes, que são altamente benéficos para ajudar os visitantes a reter o conhecimento adquirido. Ele também incorpora a gamificação, permitindo que os usuários ganhem emblemas com base em sua pontuação.

# museo_lessons
source: I learned a lot from this project, such as integrating multiple systems into one cohesive unit and delving into Bluetooth functionalities, such as establishing connections and effective data handling techniques. This was my first Flutter project, there are undoubtedly several areas requiring refactoring, and some features are missing, especially in the backend of the ticket and souvenir store. However, succeeding in solving a real problem was deeply satisfying, and the experience gained with Flutter was invaluable.
pt: Aprendi muito com esse projeto, como a integração de vários sistemas e o aprofundamento em funcionalidades Bluetooth, como o estabelecimento de conexões e técnicas de manipulação de dados. Esse foi meu primeiro projeto Flutter e, sem dúvida, há várias áreas que precisam de refatoração e melhorias, e faltam alguns recursos, especialmente no backend da loja de ingressos e lembranças. No entanto, obter sucesso na solução de um problema real foi profundamente satisfatório, e a experiência adquirida com o Flutter foi inestimável.

# courses_title
source: Courses: Personal Courses Catalog
pt: Courses: Catálogo pessoal de cursos

# courses_type
source: Personal project
pt: Projeto pessoal

# courses_presentation_summary
source: A personal project to catalog all my courses in a single place, with features of download files, presentation videos, text and images.
pt: Um projeto pessoal para catalogar todos os meus cursos em um único lugar, com recursos de download de arquivos, vídeos de apresentação, texto e imagens.

# courses_summary
source: A personal project with the goal to centralize all my courses from different platforms in one place. To do this, specific Python scripts were used for each platform, with the ability to read the screen and search for titles, summaries, videos, images and files. The project is structured around these Python scripts, using Laravel for both the backend and the frontend, hosted on AWS EC2, with image and file storage for download on AWS S3.
pt: Um projeto pessoal com o objetivo de centralizar todos os meus cursos comprados de diferentes plataformas em um único lugar. Para isso, foi utilizado scripts Python específicos para cada plataforma, com a capacidade de ler a tela e pesquisar títulos, resumos, vídeos, imagens e arquivos. O projeto está estruturado em torno desses scripts Python, utilizando Laravel tanto para o backend quanto para o frontend hospedado no AWS EC2, com armazenamento de imagens e arquivos para download no AWS S3.

# courses_project_purpose
source: The motivation for this project came from an experience where I lost access to a course because the author decided to remove the content. To prevent this from happening again, I decided to create a platform that would protect against losing access to content when it's removed or becomes unavailable on the original platform. This project provides long-term storage and consolidates multiple courses from different platforms in one place, making them easier to organize and manage.
pt: A motivação para este projeto veio de uma experiência em que perdi o acesso a um curso porque o autor decidiu remover o conteúdo. Para evitar que isso ocorresse novamente, decidi criar uma plataforma que me protegesse contra a perda de acesso ao conteúdo quando ele fosse removido ou ficasse indisponível na plataforma original. Esse projeto oferece armazenamento de longo prazo e consolida vários cursos de diferentes plataformas em um único local, facilitando a organização e o gerenciamento.

# courses_spotlight
source: The core of this project is the use of Python scripts to extract data from a variety of web pages. Selenium was used strategically to address specific scenarios, such as browsing pages with dynamic content and performing automated interactions with user interfaces. For other pages, scrapping was performed using libraries such as Requests and BeautifulSoup to ensure efficient data extraction from static HTML content. This hybrid approach allows the project to identify information across multiple platforms, optimizing data retrieval.
pt: O núcleo desse projeto é o uso de scripts Python para extrair dados de uma variedade de páginas da Web. O Selenium foi usado estrategicamente para abordar cenários específicos, como navegar em páginas com conteúdo dinâmico e realizar interações automatizadas com interfaces de usuário. Para outras páginas, o scrapping foi realizado usando bibliotecas como Requests e BeautifulSoup para garantir a extração eficiente de dados de conteúdo HTML estático. Essa abordagem híbrida permite que o projeto identifique informações em várias plataformas, otimizando a recuperação de dados.

# courses_lessons
source: This project gave me a valuable understanding of web scraping methodologies, where I learned techniques for extracting data from websites. I acquired the skills to interact with JavaScript content and automate processes. I also expanded my experience working with AWS EC2 and S3, deepening my knowledge of cloud computing infrastructure and storage solutions.
pt: Este projeto me proporcionou uma compreensão valiosa das metodologias de web scraping, onde aprendi técnicas para extrair dados de websites. Adquiri habilidades para interagir com conteúdo JavaScript e automatizar processos. Além disso, ampliei minha experiência ao trabalhar com AWS EC2 e S3, aprofundando meu conhecimento em infraestrutura de computação em nuvem e soluções de armazenamento.

# bottom_bar
source: 2024 | Designed and coded by Stephen Apolin√°rio
pt: 2024 | Projetado e desenvolvido por Stephen Apolinário
